Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: ཆུ་ལ་ཡང་མི་ནུབ་པར་འགྲོ་སྟེ། དཔེར་ན་ས་ལ་བྱ་བ་བཞིན་ནོ། །དུ་བ་འཐུལ་བར་ཡང་བྱེད།
en: They can walk on water, without sinking, as if they were on solid ground.

source: འབར་བར་ཡང་བྱེད་དེ། དཔེར་ན་མེའི་ཕུང་པོ་ཆེན་པོ་བཞིན་ནོ། །
en: They can also emit smoke and flames of fire, like a great conflagration.

source: ཉི་མ་དང་ཟླ་བ་འདི་གཉིས་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ། འདི་ལྟར་མཐུ་ཆེ་བ། འདི་ལྟར་དབང་ཆེ་བར་གྲགས་པ་འདི་དག་ལ་ཡང་ལག་པས་ཉུག་པར་བྱེད་དོ། །
en: However miraculous, powerful, and mighty the sun and the moon might be, they can reach out to touch them with their hands.

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ཡང་ལུས་ཀྱིས་དབང་སྒྱུར་རོ། །གང་གིས་རློམ་སེམས་སུ་བྱེད་པ་དང་། གང་ལ་རློམ་སེམས་སུ་བྱེད་པ་དང་།
en: They can even overwhelm the Brahmā world realms with their physical bodies.

source: གང་ཞིག་རློམ་སེམས་སུ་བྱེད་པ་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ངོ་བོ་ཉིད་ཀྱིས་དབེན་པ་ཉིད་དང་། ངོ་བོ་ཉིད་ཀྱིས་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་རྫུ་འཕྲུལ་དེས་ཀྱང་རློམ་སེམས་སུ་མི་བྱེད། རྫུ་འཕྲུལ་དེ་ལ་ཡང་རློམ་སེམས་སུ་མི་བྱེད། དམིགས་པར་ཡང་མི་བྱེད་ཅིང་།
en: Yet, they do not make assumptions on account of such miraculous abilities, nor do they make assumptions about those miraculous abilities, and they do not even apprehend them, because anything on account of which they might make assumptions, anything about which they might make assumptions, and the assumptions which they might make are all essentially empty, essentially void, and essentially non-apprehensible.

source: དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་མ་གཏོགས་པར་རྫུ་འཕྲུལ་མངོན་པར་སྒྲུབ་པའི་སེམས་པ་ཡང་མི་སྐྱེད་དོ། །
en: They focus on omniscience, and apart from that have no wish to attain miraculous abilities.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་རྫུ་འཕྲུལ་གྱི་བྱ་བ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་ཡིན་ནོ། །རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་མིག་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་གང་ཞེ་ན།
en: Su­bhūti, such is the refinement of great bodhisattva beings who practice the transcendent perfection of wisdom, in the extrasensory power that realizes miraculous abilities.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་སེམས་ཅན་འཆི་འཕོ་བ་རྣམས་དང་། སྐྱེ་བ་རྣམས་དང་། ཁ་དོག་བཟང་པོ་རྣམས་དང་། ཁ་དོག་ངན་པ་རྣམས་དང་།
en: “Su­bhūti, if you ask what constitutes the refinement of the extrasensory power realizing knowledge of divine clairvoyance, which great bodhisattva beings have—Su­bhūti, great bodhisattva beings, abiding in the transcendent perfection of wisdom, perceive through their pure clairvoyance that surpasses the vision of humans those sentient beings who are dying, those who are being reborn, those who are beautiful, those who are ugly, those in the blissful higher realms, those in the wretched lower realms, and those who are inferior, average, or excellent, according to the past actions they have accumulated.

source: བདེ་འགྲོ་དང་། ངན་འགྲོ་དང་།
en: ‘Alas!

source: ངན་པ་དང་། བར་མ་དང་། གྱ་ནོམ་པའི་སེམས་ཅན་རྣམས་ལས་ཇི་ལྟར་བསགས་པ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱི་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། ངག་གི་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ།
en: These sentient beings are endowed with misconduct of body, speech, and mind.

source: ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ།
en: They deprecate sublime beings.

source: ལོག་པར་ལྟ་བ་དང་ལྡན་པ་དག་སྟེ།
en: They maintain wrong views. Alas!

source: ཀྱེ་མ་དེ་དག་ནི་ལོག་པར་ལྟ་བ་ཡང་དག་པར་བླངས་པའི་རྒྱུ་དང་རྐྱེན་དེས་ལུས་ཞིག་སྟེ་ཤི་ནས། ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་སོ། །
en: Due to the causes and conditions of adopting wrong views as correct, when their bodies have decayed and they are dead, they will be reborn in inferior realms, falling into the lower abodes, as denizens of the hells!

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱི་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ།
en: Alas! These sentient beings are endowed with noble conduct of body.

source: ངག་གི་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱི་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་པ་དག་ཡིན་ཏེ།
en: They are endowed with noble conduct of speech, and they are endowed with noble conduct of mind.

source: རྒྱུ་དེ་དང་རྐྱེན་དེས་ལུས་ཞིག་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པའི་བར་དང་། དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: Due to these causes and conditions, when their bodies have decayed and died, they will be reborn as gods and humans, within the blissful and exalted world realms!’

source: ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་སེམས་ཅན་ལས་ཇི་ལྟར་བསགས་པ་རྣམས་མཐོང་བའི་བར་དང་། བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་སོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: and so on in the same vein, down to, ‘They see sentient beings in the world systems of all the ten directions, according to the past deeds they have accumulated,’ and, ‘These will be reborn among the gods and humans in the world systems of the happy, exalted realms.’

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷའི་མིག་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་ཡིན་ནོ། །
en: Su­bhūti, this constitutes the refinement of great bodhisattva beings who possess the extrasensory power that realizes divine clairvoyance.

source: རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷའི་རྣ་བ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ།
en: “Su­bhūti, if you ask what constitutes the refinement of the extrasensory power realizing knowledge of divine clairaudience, which great bodhisattva beings have—Su­bhūti, great bodhisattva beings, abiding in the transcendent perfection of wisdom, possess clairaudience that surpasses the human range of hearing.

source: ལྷའི་རྣ་བ་མིའི་ལས་འདས་པས་དེ་འདི་ལྟ་སྟེ། ལྷ་དང་མིའི་སྒྲ་ཉན་ཀྱང་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ངོ་བོ་ཉིད་ཀྱིས་དབེན་པ་ཉིད་དང་། ངོ་བོ་ཉིད་ཀྱིས་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་བདག་ནི་སྒྲ་ཉན་ཏོ་ཞེས་ལྷའི་རྣ་བ་དེས་ཀྱང་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་། རྣ་བས་ཤེས་པར་བྱ་བའི་སྒྲ་དེ་ཡང་མི་དམིགས་ལ།
en: But even though they can hear the voices of gods and humans, they do not make assumptions on account of their clairaudience, thinking, ‘I can hear voices,’ and they do not even apprehend the sounds that their ears hear because these are essentially empty, essentially void, and essentially non-apprehensible.

source: དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་མ་གཏོགས་པར་ལྷའི་རྣ་བ་མངོན་པར་བསྒྲུབ་པའི་ཕྱིར་སེམས་ཀྱང་སྐྱེད་པར་མི་བྱེད་དེ།
en: They focus on omniscience, and apart from that have no other wish to attain clairaudience.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། ལྷའི་རྣ་བ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་ཡིན་ནོ། །རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕ་རོལ་གྱི་སེམས་ཀྱི་རྣམ་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་གང་ཞེ་ན།
en: Su­bhūti, such is the refinement of great bodhisattva beings, abiding in the transcendent perfection of wisdom, who possess the extrasensory power that realizes clairaudience.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། དེ་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་སེམས་སེམས་ཀྱིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “Su­bhūti, if you ask what constitutes the refinement of the extrasensory power realizing knowledge of other minds, which great bodhisattva beings have—Su­bhūti, great bodhisattva beings, abiding in the transcendent perfection of wisdom, perceive with their own minds the minds of other sentient beings and the minds of other individuals, exactly as they are.

source: འདི་ལྟ་སྟེ། འདོད་ཆགས་དང་བཅས་པའི་སེམས་ལ། འདོད་ཆགས་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ལ། འདོད་ཆགས་དང་བྲལ་བའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: That is to say, they perceive minds that are afflicted with desire correctly as minds that are afflicted with desire; and they perceive minds free from desire correctly, as minds that are free from desire.

source: ཞེ་སྡང་དང་བཅས་པའི་སེམས་ལ། ཞེ་སྡང་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཞེ་སྡང་དང་བྲལ་བའི་སེམས་ལ། ཞེ་སྡང་དང་བྲལ་བའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: They perceive minds afflicted with hatred correctly, as minds that are afflicted with hatred; and they perceive minds free from hatred correctly, as minds that are free from hatred.

source: གཏི་མུག་དང་བཅས་པའི་སེམས་ལ། གཏི་མུག་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །གཏི་མུག་དང་བྲལ་བའི་སེམས་ལ། གཏི་མུག་དང་བྲལ་བའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: They perceive minds afflicted with delusion correctly, as minds that are afflicted with delusion; and they perceive minds free from delusion correctly, as minds that are free from delusion.

source: དེ་བཞིན་དུ་སྲེད་པ་དང་བཅས་པའི་སེམས་ལ། སྲེད་པ་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །སྲེད་པ་དང་བྲལ་བའི་སེམས་ལ། སྲེད་པ་དང་བྲལ་བའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །
en: Similarly, they perceive minds endowed with craving correctly, as minds that are endowed with craving; and they perceive minds free from craving correctly, as minds that are free from craving.

source: དེ་བཞིན་དུ་ཉེ་བར་ལེན་པ་དང་བཅས་པའི་སེམས་ལ། ཉེ་བར་ལེན་པ་མེད་པའི་སེམས་དང་། སེམས་བསྡུས་པ་དང་། སེམས་རྣམ་པར་གཡེངས་པ་དང་།
en: Similarly, they perceive minds endowed with grasping correctly, as minds that are endowed with grasping; and they perceive minds free from grasping correctly, as minds that are free from grasping.

source: སེམས་ཆུང་ངུ་དང་། སེམས་རྒྱ་ཆེན་པོར་གྱུར་པ་དང་། མཉམ་པར་བཞག་པའི་སེམས་དང་། མཉམ་པར་མ་བཞག་པའི་སེམས་དང་། སེམས་རྣམ་པར་གྲོལ་བ་དང་།
en: Indeed, they correctly perceive minds that are composed, minds that are distracted, minds that are narrow, minds that are spacious, minds that are absorbed, minds that are not absorbed, minds that are liberated, minds that are unliberated, and minds that are surpassed, as minds that are surpassed, [and so forth].

source: སེམས་རྣམ་པར་མ་གྲོལ་བ་དང་། བླ་ན་ཡོད་པའི་སེམས་ལ། བླ་ན་ཡོད་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །བླ་ན་མེད་པའི་སེམས་ལ། བླ་ན་མེད་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ལ།
en: They correctly perceive minds that are not surpassed as minds that are not surpassed.

source: དེ་དག་གིས་རློམ་སེམས་སུ་ཡང་མི་བྱེད་དོ། །
en: Yet, they do not make assumptions on account of these [observations].

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་སེམས་དེ་དག་ནི་སེམས་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: If you ask why, owing to the emptiness of inherent existence these minds are not minds.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཇི་ལྟར་གོང་དུ་བསྟན་པ་དེ་ཁོ་ན་བཞིན་དུ་རྒྱ་ཆེར་སྦྱར་བར་བྱ་སྟེ།
en: In the same vein, the same refrain should be applied extensively here, just as has been presented above.

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕ་རོལ་གྱི་སེམས་ཀྱི་རྣམ་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་ཡིན་ནོ། །རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་གང་ཞེ་ན།
en: Su­bhūti, this constitutes the refinement of the extrasensory power of great bodhisattva beings that realizes the knowledge of the minds of others.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་མངོན་པར་སྒྲུབ་ཅིང་། དེས་སེམས་གཅིག་རྗེས་སུ་དྲན་པ་ནས། སེམས་བརྒྱའི་བར་དང་། སེམས་སྟོང་གི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ། །
en: “Su­bhūti, if you ask what constitutes the refinement of the extrasensory power realizing knowledge of the recollection of past lives, which great bodhisattva beings have—Su­bhūti, great bodhisattva beings, abiding in the transcendent perfection of wisdom, actualize the extrasensory power of realizing the recollection of past lives, and on that basis, they may recollect one thought, or from that up to a hundred thoughts, or even up to a thousand thoughts.

source: ཉི་མ་གཅིག་ཀྱང་རྗེས་སུ་དྲན་པ་ནས་ཉི་མ་བརྒྱའི་བར་དང་། ཉི་མ་སྟོང་གི་བར་དང་། ཉི་མ་འབུམ་གྱི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ། །
en: They may also recollect one day, or from that up to a hundred days, up to a thousand days, or even up to a hundred thousand days.

source: ཟླ་བ་གཅིག་ཀྱང་རྗེས་སུ་དྲན་པ་ནས། ཟླ་བ་བརྒྱའི་བར་དང་། ཟླ་བ་སྟོང་གི་བར་དང་། ཟླ་བ་འབུམ་གྱི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ། །
en: They may also recollect one month, or from that up to a hundred months, up to a thousand months, or even up to a hundred thousand months.

source: ལོ་གཅིག་ཀྱང་རྗེས་སུ་དྲན་པ་ནས། ལོ་འབུམ་གྱི་བར་དུ་ཡང་རྗེས་སུ་དྲན་ནོ། །བསྐལ་པ་གཅིག་ཀྱང་རྗེས་སུ་དྲན་པ་ནས། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མའི་བར་དང་།
en: They may also recollect one year, or from that they may recollect up to a hundred thousand years.

source: བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་འབུམ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་ཀྱང་རྗེས་སུ་དྲན་ནོ། །
en: They may also recollect a single eon, or from that up to many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and even many hundred billion trillions of eons.

source: དེ་ན་བདག་གི་མིང་ནི་འདི་ཞེས་བྱ་བར་གྱུར།
en: ‘In that life such was my name.

source: རུས་ནི་འདི་ཞེས་བྱ།
en: Such was my family.

source: རིགས་ནི་འདི་ཞེས་བྱ།
en: Such was my social class.

source: ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ།
en: Such was the food I ate.

source: ཡུན་ནི་འདི་སྲིད་ཅིག་གནས་གནས།
en: Such was the duration of my life.

source: ཚེ་ནི་འདི་ཙམ་ཞིག་ཐུབ།
en: Such was the extent of the lifespan I could have had.

source: ཚེ་རིང་ཁྱད་ནི་འདི་ཙམ་ཞིག་ལོན།
en: Such was the extent of the particular lifespan I actually had.

source: བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་།
en: Such were the experiences of happiness and suffering I had.

source: དེ་དེ་ནས་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞིག་ཏུ་སྐྱེས་སོ། །དེ་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་སོ་ཞེས་དེ་ལྟར་རྣམ་པ་དང་བཅས།
en: Deceased from there, I was born as so and so, and then dying there, I was reborn here!’

source: ཡུལ་ཕྱོགས་དང་བཅས་པར་བདག་དང་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་དག་རྗེས་སུ་དྲན་ལ།
en: In this way, they can recollect many of their own past lives and those of other sentient beings, and other individuals, along with their circumstances and locations.

source: མངོན་པར་ཤེས་པ་དེས་ཀྱང་རློམ་སེམས་སུ་མི་བྱེད་པའི་བར་དུ་སྟེ།
en: Yet, they do not make assumptions on account of this extrasensory power, and so on.

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་ཅེས་བྱའོ། །
en: Su­bhūti, this is called the refinement of the extrasensory power that realizes the recollection of past lives with which great bodhisattva beings are endowed.

source: རབ་འབྱོར་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། ཟག་པ་ཟད་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་མངོན་པར་བསྒྲུབ་ཀྱང་ཉན་ཐོས་ཀྱི་ས་འམ།
en: “Su­bhūti, if you ask what constitutes the refinement of the extrasensory power realizing knowledge of the cessation of contaminants, which great bodhisattva beings have— Su­bhūti, great bodhisattva beings, abiding in the transcendent perfection of wisdom, actualize the extrasensory power of realizing the cessation of contaminants, and yet they do not rest in the levels of the śrāvakas and the levels of the pratyekabuddhas.

source: རང་སངས་རྒྱས་ཀྱི་ས་ཡང་རྗེས་སུ་ཐོབ་པར་མི་བྱེད་ལ། གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ཆོས་གང་ལ་ཡང་འདོད་པར་མི་བྱེད་ཅིང་།
en: Nor are they attached to any attributes through which manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment would be attained.

source: དེ་མངོན་པར་ཤེས་པ་དེས་རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་བརྟེན་ནས། བག་ཆགས་དང་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤོང་བར་བྱེད་མོད་ཀྱི། ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་དང་། ངོ་བོ་ཉིད་ཀྱིས་དབེན་པ་ཉིད་ཀྱི་ཕྱིར་དང་།
en: Through the adamantine meditative stability that comes from that extrasensory power, they abandon all involuntary reincarnation through propensities, and yet, they do not make assumptions on account of that extrasensory power of realizing the cessation of contaminants because it is essentially empty, essentially void, and essentially non-apprehensible.

source: ངོ་བོ་ཉིད་ཀྱིས་དམིགས་སུ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་ཟད་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་དེས་ཀྱང་རློམ་སེམས་སུ་མི་བྱེད་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་མ་གཏོགས་པར་སེམས་ཀྱང་སྐྱེད་པར་མི་བྱེད་དེ།
en: Apart from focusing on omniscience, they have no other wish.

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་བྱ་བ་ཤེས་པའི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་ཡིན་ནོ། །
en: Su­bhūti, this is the refinement of the extrasensory power that realizes the cessation of contaminants, which great bodhisattva beings have.

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པའི་མངོན་པར་ཤེས་པ་དྲུག་པོ་དག་ཡོངས་སུ་དག་པར་བྱེད་པ་ཉིད་ཅེས་བྱ་སྟེ། དེ་ཡང་གོ་ཆ་ཆེན་པོ་ཡིན་པར་རིག་པར་བྱའོ། །
en: “Su­bhūti, one should know that these are called the refinements of the six extrasensory powers of great bodhisattva beings who abide in the transcendent perfection of wisdom.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ལས་མངོན་པར་ཤེས་པའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅུ་པའོ།། །།
en: This completes the tenth chapter from “The Transcendent Perfection of Wisdom in Ten Thousand Lines,” entitled “Extrasensory Powers.”

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གོ་ཆ་ཆེན་པོ་ནི་འདི་ལྟ་སྟེ། ཡོངས་སུ་དག་པའི་མིག་ལྔ་སྟེ།
en: Non-abiding Chapter 11 “Moreover, Su­bhūti, the great armor of great bodhisattva beings consists of the five refined eyes.

source: ལྔ་པོ་དག་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these five, you may ask?

source: ཤའི་མིག་དང་། ལྷའི་མིག་དང་། ཤེས་རབ་ཀྱི་མིག་དང་། ཆོས་ཀྱི་མིག་དང་། སངས་རྒྱས་ཀྱི་མིག་གོ། །
en: They comprise (1) the eye of flesh, (2) the eye of divine clairvoyance, (3) the eye of wisdom, (4) the eye of the sacred doctrine, and (5) the eye of the buddhas.

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: These are called the five eyes.”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The venerable Su­bhūti then asked the Blessed One, “Reverend Lord!

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤའི་མིག་ཡོངས་སུ་དག་པ་གང་ལགས།
en: What is the refined eye of flesh, possessed by great bodhisattva beings?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་དཔག་ཚད་བརྒྱར་མཐོང་བ་ཡང་ཡོད་དོ། །
en: The Blessed One replied, “Su­bhūti, there are great bodhisattva beings who can indeed see with their eyes of flesh as far as a hundred yojanas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་དཔག་ཚད་ཉིས་བརྒྱར་མཐོང་བ་ཡང་ཡོད་དོ། །
en: There are great bodhisattva beings who can indeed see with their eyes of flesh as far as two hundred yojanas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་དཔག་ཚད་སུམ་བརྒྱར་མཐོང་བ་ཡང་ཡོད་དོ། །
en: There are great bodhisattva beings who can indeed see with their eyes of flesh as far as three hundred yojanas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་དཔག་ཚད་བཞི་བརྒྱ་དང་། ལྔ་བརྒྱ་དང་། དྲུག་བརྒྱར་མཐོང་བ་ཡང་ཡོད་དོ། །
en: There are great bodhisattva beings who can indeed see with their eyes of flesh as far as four hundred, five hundred, and six hundred yojanas.

source: ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་འཛམ་བུ་གླིང་གཅིག་མཐོང་བ་ཡང་ཡོད་དོ། །
en: Also, Su­bhūti, there are great bodhisattva beings who can indeed see with their eyes of flesh across one entire continent of Jambu­dvīpa.

source: ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་འཛམ་བུ་གླིང་གཉིས་མཐོང་བ་ནས། དེ་བཞིན་དུ་སྦྱར་ཏེ། ཤའི་མིག་གིས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་དུ་མཐོང་བ་ཡང་ཡོད་དོ། །
en: Again, Su­bhūti, there are great bodhisattva beings who can see with their eyes of flesh across two entire continents of Jambu­dvīpa, and in the same vein, there are also those who can see with their eyes of flesh across one world system comprising all four continents.

source: ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་བ་ཡང་ཡོད་དོ། །
en: Again, Su­bhūti, there are great bodhisattva beings who can indeed see with their eyes of flesh across an entire chiliocosm.

source: ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་སྟོང་གཉིས་པ་བར་མའི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་བ་ཡང་ཡོད་དོ། །
en: Also, Su­bhūti, there are great bodhisattva beings who can indeed see with their eyes of flesh across an entire dichiliocosm.

source: ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤའི་མིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་བ་ཡང་ཡོད་དོ། །
en: Again, Su­bhūti, there are great bodhisattva beings who can indeed see with their eyes of flesh across an entire great trichiliocosm.

source: རབ་འབྱོར་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤའི་མིག་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Su­bhūti, such is the refined eye of flesh possessed by great bodhisattva beings.”

source: བཅོམ་ལྡན་འདས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷའི་མིག་ཡོངས་སུ་དག་པ་གང་ལགས།
en: What is the refined eye of clairvoyance, possessed by great bodhisattva beings?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་ལྷའི་མིག་གང་ཡིན་པ་དེ་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རབ་ཏུ་ཤེས་སོ། །དེ་བཞིན་དུ་སུམ་ཅུ་རྩ་གསུམ་རྣམས་དང་།
en: The Blessed One replied, “Su­bhūti, there are great bodhisattva beings who perceive all within range of the clairvoyance of the gods of the Catur­mahā­rāja­kāyika realm.

source: འཐབ་བྲལ་རྣམས་དང་། དགའ་ལྡན་རྣམས་དང་། འཕྲུལ་དགའ་རྣམས་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ནས། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ཀྱི་ལྷའི་མིག་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རབ་ཏུ་ཤེས་ལ།
en: Similarly, there are great bodhisattva beings who perceive all within range of the clairvoyance of the gods from the Trayas­triṃśa, Yāma, Tuṣita, Nirmāṇa­rata, and Para­nirmita­vaśa­vartin realms as far as the Akaniṣṭha realm.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷའི་མིག་གང་ཡིན་པ་དེ་ནི། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་རབ་ཏུ་མི་ཤེས་པ་ནས། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ཀྱིས་རབ་ཏུ་མི་ཤེས་སོ། །
en: However, Su­bhūti, the gods of the Catur­mahā­rāja­kāyika realm do not reciprocally perceive the divine clairvoyance of the bodhisattvas, nor do the gods up to and including those of the Akaniṣṭha realm perceive it.

source: ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷའི་མིག་དེས། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སེམས་ཅན་ལས་ཇི་ལྟར་བསགས་པ་རྣམས་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དག་ཀྱང་མཐོང་། ཁ་དོག་བཟང་པོ་རྣམས་དང་།
en: Again, Su­bhūti, with their divine clairvoyance great bodhisattva beings can observe the death and rebirth of sentient beings, in accordance with their accumulated past actions, in the world systems of the eastern direction, numerous as the sands of the River Ganges.

source: ཁ་དོག་ངན་པ་རྣམས་དང་བདེ་འགྲོ་དང་། ངན་འགྲོ་དང་། ངན་པ་དང་། བར་མ་དང་། གྱ་ནོམ་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་ཏེ།
en: They also perceive those who are beautiful, those who are ugly, those dwelling in the blissful higher realms, those in the wretched lower realms, and those who are inferior, average or excellent, thinking, ‘Alas!

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱི་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། ངག་གི་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། ཡིད་ཀྱི་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ།
en: These sentient beings are endowed with misconduct of body, endowed with misconduct of speech, endowed with misconduct of mind.

source: འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ།
en: They deprecate sublime beings.

source: ལོག་པར་ལྟ་བ་དང་ལྡན་པ་དག་ཡིན་ཏེ།
en: They possess wrong views. Alas!
